// Exfmt04.go
// 测试和说明：
// 浮点数：
// %b 无小数部分、两位指数的科学计数法，和strconv.FormatFloat的'b'转换格式一致。
// %e 科学计数法，举例：-1234.456e+78
// %E 科学计数法，举例：-1234.456E+78
// %f 有小数部分，但无指数部分，举例：123.456
// %g 根据实际情况采用%e或%f格式（以获得更简洁的输出）
// %G 根据实际情况采用%E或%f格式（以获得更简洁的输出）
package main

import "fmt"

func main() {
        fmt.Printf("No01:%b\n", 888.66)
        fmt.Printf("No02:%e\n", 888.66)
        fmt.Printf("No03:%E\n", 888.66)
        fmt.Printf("No04:%f\n", 888.66)
        fmt.Printf("No05:%g\n", 888.33)
        fmt.Printf("No06:%g\n", 99999999.33)
        fmt.Printf("No07:%G\n", 888.33)
        fmt.Printf("No08:%G\n", 99999999.33)
}
// 输出：
//No01:7816736025115361p-43
//No02:8.886600e+02
//No03:8.886600E+02
//No04:888.660000
//No05:888.33
//No06:9.999999933e+07
//No07:888.33
//No08:9.999999933E+07
